Tekla Open API Reference for Tekla Structures 2025
ClashCheckHandler Class
 The ClashCheckHandler class contains clash check methods.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.ClashCheckHandler
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ClashCheckHandler
<SerializableAttribute>
Public NotInheritable Class ClashCheckHandler
The ClashCheckHandler type exposes the following members.
Methods
Name | Description
GetIntersectionBoundingBoxes
 Get a list of bounding boxes (AABB) of the clashing volumes of two objects.
RunClashCheck
 Starts the clash checking. Uses advanced options sa option values.
RunClashCheckWithOptions(Boolean, Boolean, Double, Boolean)
 Starts the clash checking with options.
RunClashCheckWithOptions(Boolean, Boolean, Boolean, Double, Boolean)
 Starts the clash checking with options.
StopClashCheck
 Stops the clash checking.
Top
Examples
using Tekla.Structures.Model;
public class Example
{
       public void Exmaple1()
       {
           Model MyModel = new Model();
           ClashCheckHandler ClashCheck = MyModel.GetClashCheckHandler();
           ClashCheck.RunClashCheck();
           ClashCheck.StopClashCheck();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace